'''
    Синтаксис Python __________________________________________________________
'''


print(type()) # Выводит тип данных в консоль

print(f"{a} - {b} - {c} ") # Вывод переменных через F-строки

 
'''
    Методы ____________________________________________________________

'''




'''
    Функции _______________________________________________________________
'''
range # ф-я котора создает некую заданную последовательность(Просим ввести число n раз)
# внутри range(...) можно использовать 3 значения (старт, конец, шаг)

# .format()________________________________________________________________
print("{} - {} - {}".format(a,b,c))# Вывод переменных через функцию format.
# ({} внутри находятся переменные a,b,c)

for i in range():
    input('{} текст : '.format(i+ 1)).split() # 







